//=============================================================================
//
// カメラ処理 [Camera.cpp]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#include "main.h"
#include "Camera.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
#define VIEW_DIST			(4)		// 最低限のキャラクターとカメラの距離
#define VIEW_DIST_RATE		(0.3f)

//*****************************************************************************
// グローバル変数
//*****************************************************************************
CAMERA cameraWk;

//=============================================================================
// カメラの初期化処理
//=============================================================================
void InitCamera(void)
{
	cameraWk.pos = CAMERA_POS;
	cameraWk.at = CAMERA_AT;
	cameraWk.up = D3DXVECTOR3(0.0f, 1.0f, 0.0f);
	cameraWk.rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);

}

//=============================================================================
// カメラの更新処理
//=============================================================================
void UpdateCamera()
{

}

//=============================================================================
// カメラの設定処理
//=============================================================================
void SetCamera(void)
{
	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	// ビューマトリックスの初期化
	D3DXMatrixIdentity(&cameraWk.mtxView);

	// ビューマトリックスの作成
	D3DXMatrixLookAtLH(&cameraWk.mtxView,
		&cameraWk.pos,		// カメラの視点
		&cameraWk.at,		// カメラの注視点
		&cameraWk.up);		// カメラの上方向ベクトル

	// ビューマトリックスの設定
	pDevice->SetTransform(D3DTS_VIEW, &cameraWk.mtxView);

	// プロジェクションマトリックスの初期化
	D3DXMatrixIdentity(&cameraWk.mtxProj);

	// プロジェクションマトリックスの作成
	D3DXMatrixPerspectiveFovLH(&cameraWk.mtxProj,
		VIEW_ANGLE,			// ビュー平面の視野角
		VIEW_ASPECT,		// ビュー平面のアスペクト比
		VIEW_NEAR_Z,		// ビュー平面のNearZ値
		VIEW_FAR_Z);		// ビュー平面のFarZ値

	// プロジェクションマトリックスの設定
	pDevice->SetTransform(D3DTS_PROJECTION, &cameraWk.mtxProj);

}

//=============================================================================
//カメラの情報を取得する
//=============================================================================
CAMERA *GetCamera(void)
{
	return &cameraWk;
}