//=============================================================================
//
// バトル画面フレーム表示処理 [Carsl_logo.h]
// Author : HAL東京 GP11B341 17 染谷武志
//
//=============================================================================
#ifndef _CARSL_LOGO_H_
#define _CARSL_LOGO_H_

#include "_2dobj.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_CARSL_LOGO	_T("data/texture/charasl_logo.png")			// フレーム用画像
#define CARSL_LOGO_SIZE		D3DXVECTOR3(1280.0f, 114.0f, 0.0f)		// テクスチャサイズ

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Carsl_logo :
	public _2dobj {
public:
	Carsl_logo();
	~Carsl_logo();

	// オーバーライド関数
	void Update();
	void Draw();
	HRESULT MakeVertex();
	void SetTexture(int cntPattern);
	void SetVertex();
};


#endif