//=============================================================================
//
// バトル画面フレーム表示処理 [Frame01.h]
// Author : HAL東京 GP11B341 17 染谷武志
//
//=============================================================================
#ifndef _FRAME01_H_
#define _FRAME01_H_

#include "_2dobj.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_FRAME01	_T("data/texture/frame000.png")			// フレーム用画像
#define FRAME01_SIZE		D3DXVECTOR3(1280.0f, 114.0f, 0.0f)		// テクスチャサイズ

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Frame01 :
	public _2dobj {
public:
	Frame01();
	~Frame01();

	// オーバーライド関数
	void Update();
	void Draw();
	HRESULT MakeVertex();
	void SetTexture(int cntPattern);
	void SetVertex();

};

#endif