//=============================================================================
//
// 重力処理 [Gravity.h]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#ifndef _GRAVITY_H_
#define _GRAVITY_H_

#include "Player.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define STANDARD_GRAVITY	(0.98f)					// 重力加速度
#define FALL_VELOCITY_MAX	(30.0f)					// 落下中最大速度

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void GravityFall(PLAYER *pP);						// 落下する計算
void PosModification(PLAYER *pP, D3DXVECTOR3 mappos);	// マップにめり込んでいた場合のプレイヤーの位置を修正する

#endif
