//=============================================================================
//
// 重力処理 [Gravity.cpp]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#include "Main.h"
#include "Gravity.h"

//=============================================================================
// 重力計算　引数：落下させるキャラクタのポインタ
//=============================================================================
void GravityFall(PLAYER *pP)
{
	// 空中はジャンプ入力できない
	pP->SetJumpFlag(true);

	// 落下最大速度よりも遅い場合、落下速度が重力加速度に合わせて加速する
	if (pP->GetJumpSpeed() > - FALL_VELOCITY_MAX)
	{
		float speed = pP->GetJumpSpeed() - STANDARD_GRAVITY;
		pP->SetJumpSpeed(speed);
	}


}
