//=============================================================================
//
// プレイヤーの状態管理（ジャンプ中）[JumpState.cpp]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#include "JumpState.h"
#include "RunningState.h"
#include "IdleState.h"
#include "VictoryState.h"
#include "Sound.h"

//=============================================================================
// コンストラクタ
//=============================================================================
JumpState::JumpState(Player *owner) : owner_(owner)
{
	PlaySound(SE_JUMP);
}

//=============================================================================
// デストラクタ
//=============================================================================
JumpState::~JumpState()
{
	owner_ = nullptr;
}

//=============================================================================
// 更新
//=============================================================================
void JumpState::Update(int AnimCurtID)
{
	// 状態変化
	// 地面に接触したらダッシュに移行
	if (owner_->GetHitGround() || owner_->GetHitPaint())
	{
		owner_->ChangeAnim(Running);
		owner_->ChangeState(new RunningState(owner_));
		return;
	}
}