//=============================================================================
//
// マップ処理 [Map.cpp]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#ifndef _MAP_H_
#define _MAP_H_

#include <iostream>
#include <string>
#include <fstream>

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAP_FILE	("data.csv")		// 読み込むマップデータ
#define MAP_SIZE_X	(10)				// マップの横サイズ
#define MAP_SIZE_Y	(10)				// マップの縦サイズ

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Map
{
private:
	string line;						// 文字列を一時的に保存
	int maptbl[MAP_SIZE_Y][MAP_SIZE_X];	// マップ用の配列
	const string delim = ",";			// データ区切り用の文字

public:
	Map();
	~Map();

	void Update();
	void Draw();

	void ReadCsv(const char *data);
};

#endif
