//=============================================================================
//
// タイトル画面処理 [SceneTitle.h]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#ifndef _SCENETITLE_H_
#define _SCENETITLE_H_

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSceneTitle();
void UninitSceneTitle();
int UpdateSceneTitle();
void DrawSceneTitle();

#endif
