//=============================================================================
//
// リザルト画面処理 [SceneGame.h]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#ifndef _SCENERESULT_H_
#define _SCENERESULT_H_

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSceneResult();
void UninitSceneResult();
void UpdateSceneResult();
void DrawSceneResult();

#endif
