//=============================================================================
//
// 空 [Sky.cpp]
// Author : HAL東京 GP12B332-19 80277 染谷武志
//
//=============================================================================
#ifndef _SKY_H_
#define _SKY_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SKY_TEXTURE	("data/MAP/BG000.png")
#define SKY_NUM_X		(13)						// 横に並べる数
#define SKY_NUM_Y		(3)							// 縦に並べる数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Sky
{
private:
	LPDIRECT3DVERTEXBUFFER9 D3DVtxBuff;	// 頂点バッファへのポインタ
	LPDIRECT3DTEXTURE9		D3DTexture;	// テクスチャへのポインタ
	D3DXVECTOR3				pos;

	HRESULT MakeVertex();

public:
	Sky();
	~Sky();

	void Update();
	void Draw();
};

#endif
